# YOLOv8n + SimAM 改进模型
# 在Backbone中添加SimAM注意力机制

nc: 4  # 类别数
scales:
  n: [0.33, 0.25, 1024]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4 输出64通道 (P3特征层)
  - [-1, 1, SimAM, []]             # 5 SimAM保持64通道
  - [-1, 1, Conv, [512, 3, 2]]     # 6-P4/16
  - [-1, 6, C2f, [512, True]]      # 7 输出128通道 (P4特征层)
  - [-1, 1, SimAM, []]             # 8 SimAM保持128通道
  - [-1, 1, Conv, [1024, 3, 2]]    # 9-P5/32
  - [-1, 3, C2f, [1024, True]]     # 10 输出256通道
  - [-1, 1, SPPF, [1024, 5]]       # 11 输出256通道

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12 from 11: 256ch
  - [[-1, 7], 1, Concat, [1]]       # 13 cat[256, 128] = 384ch (引用Layer 7)
  - [-1, 3, C2f, [512]]             # 14 输入384ch, 输出128ch

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15 from 14: 128ch
  - [[-1, 4], 1, Concat, [1]]       # 16 cat[128, 64] = 192ch (引用Layer 4)
  - [-1, 3, C2f, [256]]             # 17(P3/8) 输入192ch, 输出64ch

  - [-1, 1, Conv, [256, 3, 2]]      # 18 from 17: 64ch
  - [[-1, 14], 1, Concat, [1]]      # 19 cat[64, 128] = 192ch
  - [-1, 3, C2f, [512]]             # 20(P4/16) 输入192ch, 输出128ch

  - [-1, 1, Conv, [512, 3, 2]]      # 21 from 20: 128ch
  - [[-1, 11], 1, Concat, [1]]      # 22 cat[128, 256] = 384ch
  - [-1, 3, C2f, [1024]]            # 23(P5/32) 输入384ch, 输出256ch

  - [[17, 20, 23], 1, Detect, [nc]] # 24 Detect(P3, P4, P5)